#定義函式 part1
def multiply():
    print(3*4)   #12

#呼叫函式 part1
multiply()

#--------------------------------------------------------------------------------------------------------------#

#定義函式 part2
def multiply(n1,n2):
    print(n1*n2)

#呼叫函式 part2
multiply(3,4)  #12
multiply(5,6)  #30

#--------------------------------------------------------------------------------------------------------------#

#定義函式 part3
def multiply():
    print(3*4)   #如果沒有加return 那麼程式執行完會自動回傳 None

#呼叫函式 part3
value=multiply()  #12
print(value)      #None

#--------------------------------------------------------------------------------------------------------------#

#定義函式 part4
def multiply(n1,n2):
    print(n1*n2)
    return 10

#呼叫函式 part4
value=multiply(8,5)  #40
print(value)         #10

#--------------------------------------------------------------------------------------------------------------#

#定義函式 part5
def multiply(n1,n2):
    return n1*n2

#呼叫函式 part5
value=multiply(3,4)+multiply(10,5)  #(3*4)*(10*5)
print(value)                        #62

#--------------------------------------------------------------------------------------------------------------#

#函式可用來做程式的包裝: 同樣的邏輯可以重複利用  part1
def calculate():
    sum=0
    for i in range(1,11):
        sum=sum+i
    print(sum)

calculate()  #55

#--------------------------------------------------------------------------------------------------------------#

#函式可用來做程式的包裝: 同樣的邏輯可以重複利用  part2
def calculate(max):
    sum=0
    for i in range(1,max+1):
        sum=sum+i
    print(sum)

calculate(10) #55
calculate(20) #210
